lvx/base/DataProcessors/бит_ПолучениеОстатковРегистровБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ПолучениеОстатковРегистровБухгалтерии</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрПриемник</Name>
					<Comment>Имя регистра бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрИсточник</Name>
					<Comment>Имя регистра бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетИсточника</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоИсточника1</Name>
							<Comment>Аналитика счета учета 1</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоИсточника2</Name>
							<Comment>Аналитика счета учета 2</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоИсточника3</Name>
							<Comment>Аналитика счета учета 3</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоИсточника4</Name>
							<Comment>Аналитика счета учета 4</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПриемника</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемника1</Name>
							<Comment>Аналитика счета учета 1</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемника2</Name>
							<Comment>Аналитика счета учета 2</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемника3</Name>
							<Comment>Аналитика счета учета 3</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемника4</Name>
							<Comment>Аналитика счета учета 4</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеглДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеглКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпрДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпрКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМУДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМУКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСценарийДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСценарийКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/DataProcessors/бит_ПолучениеОстатковРегистровБухгалтерии/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АвтоТест", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.СтруктураПараметров) Тогда
		Для каждого ТекПараметр Из Параметры.СтруктураПараметров Цикл
			Объект[ТекПараметр.Ключ] = ТекПараметр.Значение;
		КонецЦикла;
	Иначе	
		ТекстСообщения = НСтр("ru='Непосредственное открытие этой формы не предусмотрено.';
							  |en='The immediate opening of this form is not provided.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ЭтоСемействоБП = бит_ОбщегоНазначения.ЭтоСемействоБП();
	
	ЗаполняемыйДокумент = Параметры.ЗаполняемыйДокумент;
	
	// Настраиваемый объект.
	ИмяОбъектаПриемника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РегистрПриемник, "ИмяОбъекта");
	Если ИмяОбъектаПриемника = "бит_Бюджетирование" Тогда
		НастраиваемыйОбъект = "Обработка.бит_ПолучениеОстатковРегистровБухгалтерии_Бюджетирование";
	Иначе	
	    НастраиваемыйОбъект = "Обработка.бит_ПолучениеОстатковРегистровБухгалтерии";
	КонецЕсли;
	
	СписокДоступныхРегистров = СформироватьСписокДоступныхРегистровБухгалтерииДляУправленческихОтчетов();
	
	ДобавитьКорСчет();
	
	// Видимость ресурсов таблицы.
	ПриемникМеждународный  = бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(ИмяОбъектаПриемника);
	ПриемникБюджетирование = ИмяОбъектаПриемника = "бит_Бюджетирование";
	Элементы.ТаблицаДанныеСуммаМУДт.Видимость = ПриемникМеждународный;
	Элементы.ТаблицаДанныеСуммаМУКт.Видимость = ПриемникМеждународный;
	Элементы.ТаблицаДанныеСуммаСценарийДт.Видимость = ПриемникБюджетирование;
	Элементы.ТаблицаДанныеСуммаСценарийКт.Видимость = ПриемникБюджетирование;
	Элементы.ТаблицаДанныеЦФО.Видимость = ПриемникБюджетирование;
	
	// Кешируем количество субконто.
	КоличествоСубконтоМУ = 4;
	
	// Устанавливаем связи параметров выбора и связи по типу субконто.
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы, "СчетИсточника", "СубконтоИсточника", 
		КоличествоСубконтоМУ, "ТаблицаДанные", "Элементы.ТаблицаДанные.ТекущиеДанные");	 
												   
	// Устанавливаем связи параметров выбора и связи по типу субконто.
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы, "СчетПриемника", "СубконтоПриемника", 
		КоличествоСубконтоМУ, "ТаблицаДанные", "Элементы.ТаблицаДанные.ТекущиеДанные");	 
												   
	ВосстановитьКоличествоДоступныхСубконто();
												   
	бит_БухгалтерскийУчет.УстановитьОформлениеСубконтоТаблицы(УсловноеОформление, "ТаблицаДанные", "СубконтоИсточника", 
		"КоличествоДоступныхСубконтоИсточника", КоличествоСубконтоМУ);
															   
	бит_БухгалтерскийУчет.УстановитьОформлениеСубконтоТаблицы(УсловноеОформление, "ТаблицаДанные", "СубконтоПриемника", 
		"КоличествоДоступныхСубконтоПриемника", КоличествоСубконтоМУ);
															   
	УстановитьЗначенияПоУмолчанию();														   
	
	Элементы.Организация.Видимость = НЕ бит_МеханизмДопИзмерений.ЕстьДопИзмерениеОрганизация();
	
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегистрБухгалтерииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрБухгалтерии"));	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов", 		СписокВидовОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы", Объект.РегистрПриемник);
	
	// Удаление из списка регистра источника.
	СписокРегистров = СписокДоступныхРегистров;
	НайденныйЭлемент = СписокРегистров.НайтиПоЗначению(Объект.РегистрПриемник);
	Если НайденныйЭлемент <> Неопределено Тогда
	    СписокРегистров.Удалить(НайденныйЭлемент);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", СписокРегистров);
	
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрИсточникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РегистрИсточник) Тогда	
		ДобавитьНастройкиОтбора();		
	КонецЕсли; 
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КорСчетПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикПользовательскиеНастройки

&НаКлиенте
Процедура КомпоновщикПользовательскиеНастройкиПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДанные

&НаКлиенте
Процедура ТаблицаДанныеЭлементОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныеПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныеСубконтоИсточникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаДанные.ТекущиеДанные;
	
	ИмяСубконто       = Прав(Элемент.Имя, 18);	
	ЗначениеСубконто  = ТекущиеДанные[ИмяСубконто];	
	
	НачалоВыбораСубконтоБУ(Элемент, СтандартнаяОбработка, ТекущиеДанные, ЗначениеСубконто, ИмяСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныеСубконтоИсточникаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СубконтоБУАвтоПодбор(Элемент, ПараметрыПолученияДанных);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ТаблицаДанныеСчетПриемникаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаДанные.ТекущиеДанные;
	ИД = ТекДанные.ПолучитьИдентификатор();
	ТаблицаДанныеСчетПриемникаПриИзмененииСервер(ИД);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область РаботаСНастройками

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки", СохраняемыеНастройки());
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ПараметрыФормы.Вставить("СохраненнаяНастройка",ТекущаяНастройка);	
	КонецЕсли; 
		
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", 
		ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", 
		ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ФлагиУстановитьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ТаблицаДанные, "Выполнять", 1, Элементы.ТаблицаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиСнятьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ТаблицаДанные, "Выполнять", 0, Элементы.ТаблицаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиИнвертировать(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ТаблицаДанные, "Выполнять", 2, Элементы.ТаблицаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	НачатьОтложенноеОбновлениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДобавить(Команда)
	
	Успех = ВыполнитьПроверкуЗаполнения();	
	Если Успех Тогда
	
		ПеренестиОстатки("Добавить");
		Закрыть();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗагрузить(Команда)
	
	Успех = ВыполнитьПроверкуЗаполнения();	
	Если Успех Тогда
	
		ПеренестиОстатки("Загрузить");
		Закрыть();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВалютнуюСумму(Команда)
	
	ЗаполнитьПустыеВалютныеСуммыПриемника();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеПроцедурыИФункции

// Функция формирует список регистров бухгалтерии.
// 
// Параметры:
//  Нет
//  
// Возвращаемое значение:
//   СписокЗначений
// 
&НаСервере
Функция СформироватьСписокДоступныхРегистровБухгалтерииДляУправленческихОтчетов()

	СписокОбъектовСистемы = Новый СписокЗначений;
	       		
	РегистрыМета = Новый Массив;
	Если Метаданные.РегистрыБухгалтерии.Найти("Хозрасчетный") <> Неопределено Тогда
		РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.Хозрасчетный);	
	КонецЕсли;
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Бюджетирование);
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_1);
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_2);
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_3);
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_4);
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_5);
	
	Для каждого МетаОбъект Из РегистрыМета Цикл
		
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
		Если ЗначениеЗаполнено(ОбъектСистемы) Тогда			
			СписокОбъектовСистемы.Добавить(ОбъектСистемы);			
		КонецЕсли; 
		
	КонецЦикла; 
		
	Возврат СписокОбъектовСистемы;
 	
КонецФункции // СформироватьСписокДоступныхРегистровБухгалтерииДляУправленческихОтчетов()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Заголовок, ТекущаяНастройка = Неопределено)
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда		
		ТекстЗаголовка = НСтр("ru='Получение остатков регистров бухгалтерии (%1)'; 
							  |en='Getting balances of accounting registers (%1)'");
		Заголовок = СтрШаблон(ТекстЗаголовка, ТекущаяНастройка);
	Иначе			
		Заголовок = НСтр("ru='Получение остатков регистров бухгалтерии'; 
						 |en='Getting balances of accounting registers'");		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область РаботаСНастройками

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеНастроек(Форма)

	Форма.Элементы.ДекорацияИзмененыНастройки.Видимость = Форма.ИзмененыНастройки;
	Форма.Элементы.ТаблицаДанные.Доступность 		 	= НЕ Форма.ИзмененыНастройки;
			
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.СтраницаНастройки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
	Элементы.ОбновитьДанные.КнопкаПоУмолчанию = Истина;

	Если ИзмененыНастройки Тогда
		ОбработатьИзменениеНастроек(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки", ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект);

	Возврат ПараметрыХранения;
	
КонецФункции

// Функция готовит стуктуру с настройками для сохранения.
//
// Возвращаемое значение:
//   СтруктураНастройки   - Структура.
//
&НаСервере
Функция СохраняемыеНастройки()

	СтруктураНастройки = Новый Структура;
	
	СтруктураНастройки.Вставить("РегистрИсточник", Объект.РегистрИсточник);
	СтруктураНастройки.Вставить("КорСчет", 		   Объект.КорСчет);
	
	СтруктураНастройки.Вставить("Настройки", Новый ХранилищеЗначения(Компоновщик.Настройки));
	СтруктураНастройки.Вставить("ПользовательскиеНастройки", Компоновщик.ПользовательскиеНастройки);
	
	Возврат СтруктураНастройки;
	
КонецФункции

// Процедура - обработчик оповещения о закрытии формы сохранения настроек. 
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(СохрНастройка, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(СохрНастройка) Тогда		
		ТекущаяНастройка = СохрНастройка;
		УстановитьЗаголовокФормы(Заголовок, ТекущаяНастройка);		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик оповещения о закрытии формы применения настроек. 
// 
&НаКлиенте 
Процедура ВыбратьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда		
		ПрименитьНастройки(Результат);		
	КонецЕсли;	
	
КонецПроцедуры

// Функция применяет сохраненные настройки.
//
// Параметры:
//  ВыбНастройка  - СправочникСсылка.бит_СохраненныеНастройки.
//
&НаСервере
Функция ПрименитьНастройки(ВыбНастройка)

	Если ЗначениеЗаполнено(ВыбНастройка) Тогда
		
		СтруктураНастроек = ВыбНастройка.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			 						
			Объект.РегистрИсточник = СтруктураНастроек.РегистрИсточник;  			
			
			Настройки = СтруктураНастроек.Настройки.Получить();
			ДобавитьНастройкиОтбора(Настройки);	
			
			Если ТипЗнч(Объект.КорСчет) = ТипЗнч(СтруктураНастроек.КорСчет) Тогда
				Объект.КорСчет = СтруктураНастроек.КорСчет;
			КонецЕсли;        			
			
			Если СтруктураНастроек.Свойство("ПользовательскиеНастройки") Тогда
				Компоновщик.ЗагрузитьПользовательскиеНастройки(СтруктураНастроек.ПользовательскиеНастройки);
			КонецЕсли;
						
			ТекущаяНастройка = ВыбНастройка;							
				
		КонецЕсли;	 
		
	КонецЕсли;
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	УстановитьЗаголовокФормы(Заголовок, ВыбНастройка);
	
КонецФункции // ПрименитьНастройки()

// Процедура устанавливает настройку либо из последних использованных, 
//	либо из настройки по умолчанию.
//
&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	// Получим настройку по - умолчанию и последнюю использованную.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТипНастройки", 			Перечисления.бит_ТипыСохраненныхНастроек.Обработки);
	СтруктураПараметров.Вставить("НастраиваемыйОбъект", 	НастраиваемыйОбъект);
	СтруктураПараметров.Вставить("ИспользоватьПриОткрытии", Истина);
	
	СохрНастройка = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект);
		
	Если ЗначениеЗаполнено(СохрНастройка) Тогда		
		ПрименитьНастройки(СохрНастройка);		
	Иначе
		УстановитьЗаголовокФормы(Заголовок);	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЭлементамиФормОбщие

// Процедура ищет 000 счет в плане счетов Источника. 
//
&НаСервере
Процедура ДобавитьКорСчет()

	Если ЗначениеЗаполнено(Объект.РегистрПриемник) Тогда
		НайденныйКорСчет = ПланыСчетов[Объект.РегистрПриемник.ИмяОбъекта].НайтиПоКоду("000");
		Если ЗначениеЗаполнено(НайденныйКорСчет) Тогда
			Объект.КорСчет = НайденныйКорСчет;
		Иначе
			Объект.КорСчет = ПланыСчетов[Объект.РегистрПриемник.ИмяОбъекта].ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Восстанавливает количество доступных субконто для счета в строках ТЧ.
// 
&НаСервере
Процедура ВосстановитьКоличествоДоступныхСубконто()
	
	// Восстанавливаем настройки субконто в зависимости от счетов учета.
	Для каждого СтрокаТаблицы Из Объект.ТаблицаДанные Цикл
        
        СвСчИс = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетИсточника);
        СвСчПр = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетПриемника);
        
		СтрокаТаблицы.КоличествоДоступныхСубконтоИсточника = СвСчИс.КоличествоСубконто;
		СтрокаТаблицы.КоличествоДоступныхСубконтоПриемника = СвСчПр.КоличествоСубконто;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет настройки в форму. 
//
&НаСервере
Процедура ДобавитьНастройкиОтбора(НастройкиКд = Неопределено)

	ЭтоХозрасчетный   = Объект.РегистрИсточник.ИмяОбъекта = "Хозрасчетный";
	ЭтоМеждународный  = бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(Объект.РегистрИсточник.ИмяОбъекта);
	ЭтоБюджетирование = Объект.РегистрИсточник.ИмяОбъекта = "бит_Бюджетирование";
	
	//--------------------------------------------------
	// Создание схемы запроса.
	СхемаЗапроса = Новый СхемаЗапроса;
	ЗапросВыбораИзИБ = СхемаЗапроса.ПакетЗапросов[0];
	
	//--------------------------------------------------
	// Установка свойств запроса.
	ЗапросВыбораИзИБ.ТаблицаДляПомещения = "Счета";
	ЗапросВыбораИзИБ.ВыбиратьРазрешенные = Истина;
	// Добавляем операторы выбора первого запроса пакета.
	ОператорВыбораЗакупок = ЗапросВыбораИзИБ.Операторы[0];
	// Добавляем запрос выбора из регистра закупок.
	ИсточникЗакупки = ОператорВыбораЗакупок.Источники.Добавить(Объект.РегистрИсточник.ИмяОбъектаПолное+".Остатки", "Остатки");
	ИсточникЗакупки.Источник.Параметры[0].Выражение = Новый ВыражениеСхемыЗапроса("&Дата") ;
	ИсточникЗакупки.Источник.Параметры[3].Выражение = Новый ВыражениеСхемыЗапроса("Организация = &Организация") ;
	// Указываем выбираемые поля.
	ОператорВыбораЗакупок.ВыбираемыеПоля.Добавить("Остатки.Счет");
	// Указываем спевдонимы для выбранных полей.
	ЗапросВыбораИзИБ.Колонки[0].Псевдоним = "Счет";

	//--------------------------------------------------
	// Второй пакет запроса.
	ЗапросВыбораИзВТ = СхемаЗапроса.ПакетЗапросов.Добавить();
	ОператорВыбораОстаткиКт = ЗапросВыбораИзВТ.Операторы[0];
	// Устанавливаем сформированную в прошлом запросе временную таблицу как источник.
	Источник = ОператорВыбораОстаткиКт.Источники.Добавить("Счета", "Счета");
	
	// Добавляем запрос выбора из регистра бухгалтерии.
	Источник = ОператорВыбораОстаткиКт.Источники.Добавить(Объект.РегистрИсточник.ИмяОбъектаПолное+".Остатки", "Остатки");
	Источник.Источник.Параметры[0].Выражение = Новый ВыражениеСхемыЗапроса("&Дата") ;
	Источник.Источник.Параметры[3].Выражение = Новый ВыражениеСхемыЗапроса("Организация = &Организация") ;
	// Задаем тип соединения.
	Источник.Соединения.Добавить("Счета", "Счета.Счет = Остатки.Счет"); 
	Источник.Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
	// Указываем выбираемые поля.
	ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("""Пассивный""");
	ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("Счета.Счет");
	ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("Остатки.Субконто1");
	ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("Остатки.Субконто2");
	ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("Остатки.Субконто3");
	Если НЕ ЭтоХозрасчетный Тогда
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("Остатки.Субконто4");
	КонецЕсли; 
	ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("Остатки.Организация");
	ЗапросВыбораИзВТ.Колонки[0].Псевдоним = "ВидСчета";
	Если ЭтоХозрасчетный Тогда
		
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("Остатки.Подразделение");
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаОстатокКт, 0)");
		ЗапросВыбораИзВТ.Колонки.Найти("Поле1").Псевдоним = "СуммаРегл";
		
	ИначеЕсли ЭтоМеждународный Тогда	
		
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаРеглОстатокКт, 0)");
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаУпрОстатокКт, 0)");
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаМУОстатокКт, 0)");
		ЗапросВыбораИзВТ.Колонки[7].Псевдоним = "СуммаРегл";
		ЗапросВыбораИзВТ.Колонки[8].Псевдоним = "СуммаУпр";
		ЗапросВыбораИзВТ.Колонки[9].Псевдоним = "СуммаМУ";
		
	ИначеЕсли ЭтоБюджетирование Тогда 	
		
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаРеглОстатокКт, 0)");
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаУпрОстатокКт, 0)");
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаСценарийОстатокКт, 0)");
		ЗапросВыбораИзВТ.Колонки[7].Псевдоним = "СуммаРегл";
		ЗапросВыбораИзВТ.Колонки[8].Псевдоним = "СуммаУпр";
		ЗапросВыбораИзВТ.Колонки[9].Псевдоним = "СуммаСценарий";
		
	Иначе 	
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаРеглОстатокКт, 0)");
		ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаУпрОстатокКт, 0)");
		ЗапросВыбораИзВТ.Колонки[7].Псевдоним = "СуммаРегл";
		ЗапросВыбораИзВТ.Колонки[8].Псевдоним = "СуммаУпр";
		
	КонецЕсли;
		
	// Добавляем отбор.
	ОператорВыбораОстаткиКт.Отбор.Добавить("Счета.Счет.Вид = &Пас ИЛИ Счета.Счет.Вид = &АктПас");

	//--------------------------------------------------
	ОператорВыбораОстаткиДт = ЗапросВыбораИзВТ.Операторы.Добавить();
	// Устанавливаем сформированную в прошлом запросе временную таблицу как источник.
	Источник = ОператорВыбораОстаткиДт.Источники.Добавить("Счета","Счета");
	
	// Добавляем запрос выбора из регистра бухгалтерии.
	Источник = ОператорВыбораОстаткиДт.Источники.Добавить(Объект.РегистрИсточник.ИмяОбъектаПолное+".Остатки", "Остатки");
	Источник.Источник.Параметры[0].Выражение = Новый ВыражениеСхемыЗапроса("&Дата") ;
	Источник.Источник.Параметры[3].Выражение = Новый ВыражениеСхемыЗапроса("Организация = &Организация") ;
	
	// Задаем тип соединения.
	Источник.Соединения.Добавить("Счета", "Счета.Счет = Остатки.Счет"); 
	Источник.Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
	
	// Указываем выбираемые поля.
	ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("Счета.Счет");
	ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("Остатки.Организация");
	ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("Остатки.Субконто1");
	ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("Остатки.Субконто2");
	ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("Остатки.Субконто3");
	
	Если НЕ ЭтоХозрасчетный Тогда	
		ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("Остатки.Субконто4");	
	КонецЕсли; 
	
	ПолеВидСчета 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("""Активный""");
	ЗапросВыбораИзВТ.Колонки[0].Поля.Установить(1,ПолеВидСчета);
	
	Если ЭтоХозрасчетный Тогда		
		ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("Остатки.Подразделение");
		ПолеСуммаРегл 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаОстатокДт, 0)");
		ЗапросВыбораИзВТ.Колонки.Найти("СуммаРегл").Поля.Установить(1, ПолеСуммаРегл);						
	ИначеЕсли ЭтоМеждународный Тогда		
		ПолеСуммаУпр 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаУпрОстатокДт, 0)");
		ПолеСуммаРегл 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаРеглОстатокДт, 0)");
		ПолеСуммаМУ 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаМУОстатокДт, 0)");
		ЗапросВыбораИзВТ.Колонки[7].Поля.Установить(1,ПолеСуммаРегл);
		ЗапросВыбораИзВТ.Колонки[8].Поля.Установить(1,ПолеСуммаУпр);
		ЗапросВыбораИзВТ.Колонки[9].Поля.Установить(1,ПолеСуммаМУ);		
	ИначеЕсли ЭтоБюджетирование Тогда		
		ПолеСуммаУпр 		= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаУпрОстатокДт, 0)");
		ПолеСуммаРегл 		= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаРеглОстатокДт, 0)");
		ПолеСуммаСценарий 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаСценарийОстатокДт, 0)");
		ЗапросВыбораИзВТ.Колонки[7].Поля.Установить(1,ПолеСуммаРегл);
		ЗапросВыбораИзВТ.Колонки[8].Поля.Установить(1,ПолеСуммаУпр);
		ЗапросВыбораИзВТ.Колонки[9].Поля.Установить(1,ПолеСуммаСценарий);		
	Иначе 	
		ПолеСуммаУпр 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаУпрОстатокДт, 0)");
		ПолеСуммаРегл 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.СуммаРеглОстатокДт, 0)");
		ЗапросВыбораИзВТ.Колонки[7].Поля.Установить(1,ПолеСуммаРегл);
		ЗапросВыбораИзВТ.Колонки[8].Поля.Установить(1,ПолеСуммаУпр);		
	КонецЕсли;       	
	
	//--------------------------------------------------
	// Количество.
	ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.КоличествоОстатокКт, 0)");
	ЗапросВыбораИзВТ.Колонки.Найти("Поле1").Псевдоним = "Количество";
	ПолеДт 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.КоличествоОстатокДт, 0)");
	ЗапросВыбораИзВТ.Колонки.Найти("Количество").Поля.Установить(1, ПолеДт);
	// Валютная сумма.	
	ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.ВалютнаяСуммаОстатокКт, 0)");
	ЗапросВыбораИзВТ.Колонки.Найти("Поле1").Псевдоним = "ВалютнаяСумма";
	ПолеДт 	= ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("ЕСТЬNULL(Остатки.ВалютнаяСуммаОстатокДт, 0)");
	ЗапросВыбораИзВТ.Колонки.Найти("ВалютнаяСумма").Поля.Установить(1, ПолеДт);
	// Валюта.
	ОператорВыбораОстаткиКт.ВыбираемыеПоля.Добавить("Остатки.Валюта");
	ОператорВыбораОстаткиДт.ВыбираемыеПоля.Добавить("Остатки.Валюта");
	
	//--------------------------------------------------
	// Добавляем отбор.
	ОператорВыбораОстаткиДт.Отбор.Добавить("Счета.Счет.Вид = &Акт ИЛИ Счета.Счет.Вид = &АктПас");

	//--------------------------------------------------
	// Последний запрос пакета - удаление временной таблицы.
	ЗапросУничтоженияВТ = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
	ЗапросУничтоженияВТ.ИмяТаблицы = "Счета";
	
	фТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
					
	СхемаКомпоновкиДанных = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(фТекстЗапроса);
	
	// Добавим поля быстрого отбора.
	МассивПолей = Новый Массив;
	МассивПолей.Добавить("Счет");
	МассивПолей.Добавить("Субконто1");
	МассивПолей.Добавить("Субконто2");
	МассивПолей.Добавить("Субконто3");
	Если НЕ ЭтоХозрасчетный Тогда
		МассивПолей.Добавить("Субконто4");
	КонецЕсли; 
	
	// Для отображения отборов на форме в пользовательских настройках.
	ОтборСКД = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор;      	
	
	Если НастройкиКд = Неопределено Тогда		
		Для каждого Поле Из МассивПолей Цикл		 			
			НовыйОтбор = ОтборСКД.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		    НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
		    НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		    НовыйОтбор.Использование = Ложь;
		    НовыйОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			НовыйОтбор.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;			
		КонецЦикла;	
	Иначе		
		Для каждого ЭлОтбор Из НастройкиКд.Отбор.Элементы Цикл		 			
			НовыйОтбор = ОтборСКД.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовыйОтбор, ЭлОтбор);			
		КонецЦикла;		
	КонецЕсли;

	АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;	
    ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
    Попытка                   
		Компоновщик.Инициализировать(ИсточникНастроек);                   
    Исключение                   
		ТекстСообщения = НСтр("ru='Не удалось инициализировать компоновщик для отбора. Описание ошибки: %1.';
						  	  |en='Failed to initialize linker for selection. Error description: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);                   
	КонецПопытки;
	
    Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Компоновщик.ПользовательскиеНастройки.Элементы.Количество();

КонецПроцедуры // ДобавитьНастройкиОтбора()

#КонецОбласти

#Область РаботаСТаблицейФормыТаблицаДанные

// Процедура обработчик "ПриИзменении" счета приемника табличной части. 
//
&НаСервере
Процедура ТаблицаДанныеСчетПриемникаПриИзмененииСервер(ИД)

	ВосстановитьКоличествоДоступныхСубконто();
	
	ТекущаяСтрока = Объект.ТаблицаДанные.НайтиПоИдентификатору(ИД);
	
	КоличествоСубконто = 4;
	
	инд = 0;
	Для инд = инд + 1 По КоличествоСубконто Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока["СубконтоИсточника"+инд]) Тогда  
			
			Для каждого СубконтоПриемника Из ТекущаяСтрока.СчетПриемника.ВидыСубконто Цикл
				
				Если СубконтоПриемника.ВидСубконто.ТипЗначения <> Неопределено
					И ТипЗнч(ТекущаяСтрока["СубконтоИсточника"+инд]) = СубконтоПриемника.ВидСубконто.ТипЗначения.Типы()[0] Тогда
				
					ТекущаяСтрока["СубконтоПриемника"+СубконтоПриемника.НомерСтроки] = ТекущаяСтрока["СубконтоИсточника"+инд];
				
				КонецЕсли; 
			
			КонецЦикла; 
			
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры // ТаблицаДанныеСчетПриемникаПриИзмененииСервер()

// Процедура обрабатывает начало выбора субконто.
// 
// Параметры:
//  Элемент              - ЭлементУправления.
//  СтандартнаяОбработка - Булево.
//  Контейнер            - Произвольный.
//  ЗначениеСубконто     - Произвольный.
//  ИмяСубконто  		 - Строка.
// 
&НаКлиенте
Процедура НачалоВыбораСубконтоБУ(Элемент, СтандартнаяОбработка, Контейнер, ЗначениеСубконто, ИмяСубконто)
	
	Если ЭтоСемействоБП И ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(Контейнер, СтандартнаяОбработка, ИмяСубконто);
		
	Иначе
		
		НачалоИмениСубконто = Лев(ИмяСубконто, 17);
		
		СтруктураПараметров = бит_БухгалтерияКлиент.ПодготовитьПараметрыВыбораСубконто(Контейнер, 
			НачалоИмениСубконто, ЗначениеСубконто, КоличествоСубконтоМУ, Объект);	
	
		// Установим параметры выбора субконто.
		бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров);
	
	КонецЕсли;
	
КонецПроцедуры // НачалоВыбораСубконто()

// Процедура обрабатывает авто-подбор субконто.
// 
// Параметры:
//  Элемент - ПолеФормы.
//  Параметры - Структура
// 
&НаКлиенте
Процедура СубконтоБУАвтоПодбор(Элемент, ПараметрыПолученияДанных)

	ТекущиеДанные = Элементы.ТаблицаДанные.ТекущиеДанные;	
	
	ИмяСубконто       = Прав(Элемент.Имя, 18);	
	ЗначениеСубконто  = ТекущиеДанные[ИмяСубконто];	
	
	НачалоИмениСубконто = Лев(ИмяСубконто, 17);
	
	СтруктураПараметров = бит_БухгалтерияКлиент.ПодготовитьПараметрыВыбораСубконто(ТекущиеДанные, 
		НачалоИмениСубконто, ЗначениеСубконто, КоличествоСубконтоМУ, Объект);	

	// Установим параметры выбора субконто.
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров);

	Для каждого КиЗ Из СтруктураПараметров Цикл	
		ПараметрыПолученияДанных.Отбор.Вставить(КиЗ.Ключ, КиЗ.Значение);	
	КонецЦикла; 
		
КонецПроцедуры // СубконтоБУАвтоПодбор()

#КонецОбласти

#Область РаботаСКомандамиФормы

// Процедура производит заполнение валютных сумм для счетов приемника,
// по которым ведется валютный учет в случае отсутствия валютного учета по счету источника.
//
&НаСервере
Процедура ЗаполнитьПустыеВалютныеСуммыПриемника()

	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	Если НЕ ЗначениеЗаполнено(ВалютаРегл) Тогда
		ТекстСообщения = НСтр("ru='Не заполнена валюта регламентированного учета.';
							  |en='Not filled regulated accounting currency.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
	 	Возврат;
	КонецЕсли;
	
	Для каждого СтрТаб Из Объект.ТаблицаДанные Цикл
        
        СвСчИс = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрТаб.СчетИсточника);
        СвСчПр = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрТаб.СчетПриемника);
        
		Если (НЕ СвСчИс.Валютный) И СвСчПр.Валютный 
			И (НЕ ЗначениеЗаполнено(СтрТаб.Валюта)) Тогда
		
			СтрТаб.Валюта 		 = ВалютаРегл;
			СтрТаб.ВалютнаяСумма = ?(СтрТаб.СуммаРеглДт = 0, СтрТаб.СуммаРеглКт, СтрТаб.СуммаРеглДт);
		
		КонецЕсли;	
		   
	КонецЦикла;

КонецПроцедуры // ЗаполнитьПустыеВалютныеСуммыПриемника()

#КонецОбласти

#Область ОбновлениеТаблицыДанных

// Процедура обрабатывает изменение счета в табличном поле "ТаблицаДанные".
// 
// Параметры:
//  Идентификатор  - Число - Индентификатор строки табличной части.
// 
&НаСервере         
Процедура ИзменениеСчета(Идентификатор, ИмяСчета)
	                       
	ТекущаяСтрока = Объект.ТаблицаДанные.НайтиПоИдентификатору(Идентификатор);
	
	ТекСчет = ТекущаяСтрока["Счет" + ИмяСчета];
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекСчет, КоличествоСубконтоМУ);									  
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(ТекущаяСтрока, НастройкиСубконто, "Субконто" + ИмяСчета);
	   	
	Если ТекСчет = Неопределено Тогда
		ТекущаяСтрока["КоличествоДоступныхСубконто" + ИмяСчета] = 0;
    Иначе
        СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекСчет);
		ТекущаяСтрока["КоличествоДоступныхСубконто" + ИмяСчета] = СвСч.КоличествоСубконто; 	
	КонецЕсли;
		
КонецПроцедуры // ИзменениеСчета()

&НаКлиенте
Процедура НачатьОтложенноеОбновлениеДанных()
		
	Объект.ТаблицаДанные.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.РегистрИсточник) Тогда
		Возврат;
	КонецЕсли; 
	
	ИзмененыНастройки = Ложь;	
	СкрытьНастройки();
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
	ДлительнаяОперация    = НачатьОтложенноеОбновлениеДанныхНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтложенноеОбновлениеДанныхЗавершение", ЭтотОбъект);
	ПараметрыОжидания     = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьОтложенноеОбновлениеДанныхНаСервере()
			
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ВыполняемыйМетод    = "Обработки.бит_ПолучениеОстатковРегистровБухгалтерии.ОстаткиРегистраБухгалтерии";
	
	// Выполняем запрос с помощью схемы компоновки данных.
	СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСКД);
	НастройкиКомпоновки = Компоновщик.ПолучитьНастройки();
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "Организация", Объект.Организация);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "Пас", 		ВидСчета.Пассивный);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "Акт", 		ВидСчета.Активный);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "АктПас", 		ВидСчета.АктивноПассивный);
	
	ГраницаДата = Новый Граница(Объект.Дата, ВидГраницы.Включая);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "Дата", ГраницаДата);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РегистрИсточник", 	 Объект.РегистрИсточник);
	ДопПараметры.Вставить("РегистрПриемник", 	 Объект.РегистрПриемник);
	ДопПараметры.Вставить("Организация", 		 Объект.Организация);
	ДопПараметры.Вставить("Дата", 				 Объект.Дата);
	ДопПараметры.Вставить("ЗаполняемыйДокумент", ЗаполняемыйДокумент);
		
	ШаблонДанных = Объект.ТаблицаДанные.Выгрузить();
		
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
		СхемаКомпоновки, НастройкиКомпоновки, ШаблонДанных, ДопПараметры);
	
КонецФункции
			
&НаКлиенте
Процедура ОтложенноеОбновлениеДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении, по причине: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе	
		ОбновлениеДанныхЗавершениеНаСервере(Результат.АдресРезультата);
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ОбновлениеДанныхЗавершениеНаСервере(АдресРезультата)

	ТаблицаРезультат = ПолучитьИзВременногоХранилища(АдресРезультата);		
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если НЕ ЗначениеЗаполнено(ТаблицаРезультат) Тогда		
		ТекстСообщения = НСтр("ru='Нет данных, удовлетворяющих отбору';en='No data satisfying the selection'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		Возврат;		
	КонецЕсли;
	
	Объект.ТаблицаДанные.Загрузить(ТаблицаРезультат);

	Для каждого СтрокаТаблицы Из Объект.ТаблицаДанные Цикл	
		Идентификатор = СтрокаТаблицы.ПолучитьИдентификатор();
		ИзменениеСчета(Идентификатор, "Источника");
		ИзменениеСчета(Идентификатор, "Приемника");
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПереносОбъектовИзОбработки

// Функция проверяет заполнение формы.
//
&НаСервере
Функция ВыполнитьПроверкуЗаполнения()

	Выполнено = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.КорСчет) Тогда		
		Выполнено = Ложь;		
		ТекстСообщения = НСтр("ru='Необходимо заполнить вспомогательный счет.'; 
							  |en='Sub account required.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли; 

	Отбор = Новый Структура("Выполнять", Истина);
	Строки = Объект.ТаблицаДанные.НайтиСтроки(Отбор);
	
	Для каждого Строка Из Строки Цикл
	
		Если НЕ ЗначениеЗаполнено(Строка.СчетПриемника) Тогда		
			ТекстСообщения = НСтр("ru='В строке %1 необходимо заполнить счет приемника.'; 
								  |en='In line %1, you need to fill in the receiver account.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецЕсли; 
	
	КонецЦикла; 
	
	Возврат Выполнено;
	
КонецФункции // ВыполнитьПроверкуЗаполнения()

// Процедура упаковывает в таблицу значений строки для переноса.
// 
&НаСервере
Функция УпаковатьТаблицуЗначений()

	СтрОтбора = Новый Структура("Выполнять", Истина);
	СтрокиДляПереноса = Объект.ТаблицаДанные.НайтиСтроки(СтрОтбора);

	Если СтрокиДляПереноса.Количество() = 0 Тогда
		Возврат Неопределено;		
	КонецЕсли;	
		
	ТаблицаСтрок = Объект.ТаблицаДанные.Выгрузить(СтрокиДляПереноса);
	УпакованнаяТаблица = бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТаблицаСтрок);
	
	Возврат УпакованнаяТаблица;
	
КонецФункции // УпаковатьТаблицуЗначений()

// Процедура переносит остатки в операцию.
// 
// Параметры:
//  ИмяКоманды - Строка.
// 
&НаКлиенте
Процедура ПеренестиОстатки(ИмяКоманды)

	УпакованнаяТаблица = УпаковатьТаблицуЗначений();
	Если УпакованнаяТаблица <> Неопределено Тогда
		
		СтрПереноса = Новый Структура;
		СтрПереноса.Вставить("Хранилище", УпакованнаяТаблица);
		
		Если ИмяКоманды = "Загрузить" Тогда 		
			СтрПереноса.Вставить("ОчищатьТабЧасть", Истина); 			
		Иначе	
			СтрПереноса.Вставить("ОчищатьТабЧасть", Ложь);
		КонецЕсли;
		
		СтрПереноса.Вставить("ДатаТрансляции", 	   Объект.Дата);
		СтрПереноса.Вставить("ДополнительныйСчет", Объект.КорСчет);
		
		Оповестить("бит_ПереносОстатков", СтрПереноса, ВладелецФормы);	
		
	КонецЕсли; 
	
КонецПроцедуры // ПеренестиОстатки()

#КонецОбласти

#КонецОбласти
